#include <stdio.h>

void rencode(int* a1, int* a2, int* a3, int* a4) {
	int t1, t2, t3, t4, v1, v2, v3, v4;
	t1 = *a1;
	t2 = *a1 ^ *a2;
	t3 = *a3 ^ *a2;
	t4 = *a4 ^ *a3;

	v1 = ((t1 >> 7)&1) | (t3 << 1);
	v2 = (t1 << 1) | ((t3 >> 7)&1);
	v3 = ((t2>> 6)&3) | (t4 << 2);
	v4 = (t2 << 2) | ((t4 >> 6)&3);

	*a1 = v1;
	*a2 = v2;
	*a3 = v3;
	*a4 = v4;
}

int main()
{
	int v[] = {63,143,163,188,141,39,122,103,226,3,162,224,172,234,149,139,163,237,204,182,50,140,148,82,130,138,20,198,245,174,104,115,0 };

	for (int i = 28; i >=0 ; --i) {
		/*int a = v[i];//a
		int b = v[i + 1] ^ v[i];//b
		int c = v[i+2] ^ v[i+1];//c
		int d = v[i+3] ^ v[i+2];//d
		
		v[(i)] = (a >> 7) | (c << 1);
		v[(i + 1)] = (a << 1) | (c >> 7);
		v[(i + 2)] = (b >> 6) | (d << 2);
		v[(i + 3)] = (b << 2) | (d >> 6);*/

		rencode(&v[i], &v[i + 1], &v[i + 2], &v[i + 3]);
	}

	for (int j = 0; j <= 31; j++) {
		unsigned char x = 0x11;
		v[j] ^= 17;
		printf("%c", v[j]);
	}

	//ÓîîîîïïýùqAîïï\EïÀaïï?Ý™ïïîîï}
	//ÓîîîîïïýùqAîïï\EïÀaïï?Ý™ïïîîï}
	//Wn¼éêèTçŒ?äI´ííôïùðí­nþìhÿÿho?}
	//}?ohÿÿhìþn­íðùïôíí´I?ÍŒçTèêé¼nW
	//Wn¼éêèTçŒ?äI´ííôïùðí­nþìhÿÿho?}ÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌÌ
	
	return 0;
}